# 5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

numLetter = int(input("Enter number of letter:\n"))

print(chr(numLetter + 96))
